In [1]:
import pandas as pd
x = pd.read_csv("5prog_1experience.csv")

In [5]:
x

   YearsExperience
0              1.1
1              1.3
2              1.5
3              2.0
4              2.2
5              2.9
6              3.0
7              3.2
8              3.2

In [6]:
x.shape

(9, 1)

In [7]:
len(x)

9

In [16]:
x.head()

   YearsExperience
0              1.1
1              1.3
2              1.5
3              2.0
4              2.2

In [12]:
x.tail(2)

   YearsExperience
7              3.2
8              3.2